# NumberOfCurves Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..NumberOfCurves Method
CurveLoop Class See Also
---
Returns the number of curves in the curve loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public int NumberOfCurves()
```

Visual Basic
---
```text
Public Function NumberOfCurves As Integer
```

Visual C++
---
```text
public:
int NumberOfCurves()
```

# ### Return Value
The number of curves in the curve loop.
# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace